Revit 2027 API
FamilyElementVisibility Constructor
Initializes a new instance of the FamilyElementVisibility class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyElementVisibility(
	FamilyElementVisibilityType visibilityType
)
Public Sub New (
	visibilityType As FamilyElementVisibilityType
)
public:
FamilyElementVisibility(
	FamilyElementVisibilityType visibilityType
)
new :
        visibilityType : FamilyElementVisibilityType -> FamilyElementVisibility
Parameters
visibilityType FamilyElementVisibilityType
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace